Repository: pikougi-nabot/epochrefs-old
Catalog: commit/84000/data-translation-memory/toh44-45_84000-the-stem-array.tmx/chapters-10-18.tmx
Source language: bo
Languages: en

source: དེ་བཞིན་གཤེགས་པ་གཅིག་གི་བསྟན་པ་ཡོངས་སུ་གཟུང་བའི་ཕྱིར་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་སེམས་བྱང་ཆུབ་ཏུ་སྐྱེ་བ་མ་ཡིན་པ་ནས། སངས་རྒྱས་ཀྱི་ཞིང་བརྗོད་དུ་མེད་པའི་ཡང་བརྗོད་དུ་མེད་པའི་རྡུལ་ཤིན་ཏུ་ཕྲ་བ་སྙེད་ཀྱི་དེ་བཞིན་གཤེགས་པའི་བསྟན་པ་ཡོངས་སུ་གཟུང་བའི་ཕྱིར་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་སེམས་བྱང་ཆུབ་ཏུ་སྐྱེ་བ་མ་ཡིན།
en: “The bodhisattvas do not develop the aspiration for enlightenment in order to hold the teachings of one tathāgata and so on up to the bodhisattvas do not develop the aspiration for enlightenment in order to hold the teachings of tathāgatas as numerous as the atoms in an anabhilāpyānabhilāpya­parivarta of world realms.

source: སངས་རྒྱས་གཅིག་རབ་ཏུ་ཞུགས་པའི་སྨོན་ལམ་རྣམ་པ་ཐ་དད་པ་ལ་འཇུག་པའི་ཕྱིར་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་སེམས་བྱང་ཆུབ་ཏུ་སྐྱེ་བ་མ་ཡིན་པ་ནས།
en: “The bodhisattvas do not develop the aspiration for enlightenment in order to comprehend the different prayers established by one buddha and so on up to the bodhisattvas do not develop the aspiration for enlightenment in order to comprehend the different prayers established by buddhas as numerous as the atoms in an anabhilāpyānabhilāpya­parivarta of world realms.

source: སངས་རྒྱས་ཀྱི་ཞིང་བརྗོད་དུ་མེད་པའི་ཡང་བརྗོད་དུ་མེད་པའི་རྡུལ་ཤིན་ཏུ་ཕྲ་བ་སྙེད་ཀྱི་སངས་རྒྱས་རབ་ཏུ་ཞུགས་པའི་སྨོན་ལམ་རྣམ་པ་ཐ་དད་པ་ལ་འཇུག་པའི་ཕྱིར་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་སེམས་བྱང་ཆུབ་ཏུ་སྐྱེ་བ་མ་ཡིན་ནོ། །དེ་བཞིན་གཤེགས་པ་གཅིག་གི་སངས་རྒྱས་ཀྱི་ཞིང་གི་རྒྱན་ལ་འཇུག་པར་བྱ་བའི་ཕྱིར། བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་སེམས་བྱང་ཆུབ་ཏུ་སྐྱེ་བ་མ་ཡིན་པ་ནས། སངས་རྒྱས་ཀྱི་ཞིང་བརྗོད་དུ་མེད་པའི་ཡང་བརྗོད་དུ་མེད་པའི་རྡུལ་ཤིན་ཏུ་ཕྲ་བ་སྙེད་ཀྱི་དེ་བཞིན་གཤེགས་པའི་སངས་རྒྱས་ཀྱི་ཞིང་གི་རྒྱན་ལ་འཇུག་པར་བྱ་བའི་ཕྱིར། བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་སེམས་བྱང་ཆུབ་ཏུ་སྐྱེ་བ་མ་ཡིན།
en: “The bodhisattvas do not develop the aspiration for enlightenment in order to enter the displays of one buddha realm and so on up to the bodhisattvas do not develop the aspiration for enlightenment in order to enter the displays of buddha realms as numerous as the atoms in an anabhilāpyānabhilāpya­parivarta of world realms.

source: སངས་རྒྱས་གཅིག་གི་འཁོར་གྱི་དཀྱིལ་འཁོར་རྣམ་པར་ཕྱེ་བ་ལ་འཇུག་པར་བྱ་བའི་ཕྱིར་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་སེམས་བྱང་ཆུབ་ཏུ་སྐྱེ་བ་མ་ཡིན་པ་ནས། སངས་རྒྱས་ཀྱི་ཞིང་བརྗོད་དུ་མེད་པའི་ཡང་བརྗོད་དུ་མེད་པའི་རྡུལ་ཤིན་ཏུ་ཕྲ་བ་སྙེད་ཀྱི་འཁོར་གྱི་དཀྱིལ་འཁོར་རྣམ་པར་ཕྱེ་བ་ལ་འཇུག་པར་བྱ་བའི་ཕྱིར་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་སེམས་བྱང་ཆུབ་ཏུ་སྐྱེ་བ་མ་ཡིན།
en: “The bodhisattvas do not develop the aspiration for enlightenment in order to enter the circle of followers of one buddha and so on up to the bodhisattvas do not develop the aspiration for enlightenment in order to enter the circle of followers of buddhas as numerous as the atoms an anabhilāpyānabhilāpya­parivarta of world realms.

source: དེ་བཞིན་གཤེགས་པ་གཅིག་གི་ཆོས་ཀྱི་འཁོར་ལོ་ཡོངས་སུ་གཟུང་བའི་ཕྱིར་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་སེམས་བྱང་ཆུབ་ཏུ་སྐྱེ་བ་མ་ཡིན་པ་ནས། སངས་རྒྱས་ཀྱི་ཞིང་བརྗོད་དུ་མེད་པའི་ཡང་བརྗོད་དུ་མེད་པའི་རྡུལ་ཤིན་ཏུ་ཕྲ་བ་སྙེད་ཀྱི་དེ་བཞིན་གཤེགས་པའི་ཆོས་ཀྱི་འཁོར་ལོ་ཡོངས་སུ་གཟུང་བའི་ཕྱིར་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་སེམས་བྱང་ཆུབ་ཏུ་སྐྱེ་བ་མ་ཡིན།
en: “The bodhisattvas do not develop the aspiration for enlightenment in order to possess the Dharma wheel of one tathāgata and so on up to the bodhisattvas do not develop the aspiration for enlightenment in order to possess the Dharma wheel of tathāgatas as numerous as the atoms in an anabhilāpyānabhilāpya­parivarta of world realms.

source: སེམས་ཅན་གྱི་སེམས་རྒྱ་མཚོ་གཅིག་ཁོང་དུ་ཆུད་པར་བྱ་བའི་ཕྱིར། བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་སེམས་བྱང་ཆུབ་ཏུ་སྐྱེ་བ་མ་ཡིན་པ་ནས། སངས་རྒྱས་ཀྱི་ཞིང་བརྗོད་དུ་མེད་པའི་ཡང་བརྗོད་དུ་མེད་པའི་རྡུལ་ཤིན་ཏུ་ཕྲ་བ་སྙེད་ཀྱི་སེམས་ཅན་གྱི་སེམས་རྒྱ་མཚོ་ཁོང་དུ་ཆུད་པར་བྱ་བའི་ཕྱིར། བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་སེམས་བྱང་ཆུབ་ཏུ་སྐྱེ་བ་མ་ཡིན།
en: “The bodhisattvas do not develop the aspiration for enlightenment in order to comprehend the ocean of the mind of one being and so on up to the bodhisattvas do not develop the aspiration for enlightenment in order to comprehend the oceans of the minds of beings as numerous as the atoms in an anabhilāpyānabhilāpya­parivarta of world realms.

source: སེམས་ཅན་གཅིག་གི་དབང་པོའི་འཁོར་ལོ་ཡོངས་སུ་ཤེས་པར་བྱ་བའི་ཕྱིར། བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་སེམས་བྱང་ཆུབ་ཏུ་སྐྱེ་བ་མ་ཡིན་པ་ནས། སངས་རྒྱས་ཀྱི་ཞིང་བརྗོད་དུ་མེད་པའི་ཡང་བརྗོད་དུ་མེད་པའི་རྡུལ་ཤིན་ཏུ་ཕྲ་བ་སྙེད་ཀྱི་སེམས་ཅན་གྱི་དབང་པོའི་འཁོར་ལོ་ཡོངས་སུ་ཤེས་པར་བྱ་བའི་ཕྱིར། བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་སེམས་བྱང་ཆུབ་ཏུ་སྐྱེ་བ་མ་ཡིན།
en: “The bodhisattvas do not develop the aspiration for enlightenment in order to know the wheel of faculties of one being and so on up to the bodhisattvas do not develop the aspiration for enlightenment in order to know the wheels of faculties of beings as numerous as the atoms in an anabhilāpyānabhilāpyaparivarta of world realms.

source: སེམས་ཅན་གཅིག་གི་དབང་པོ་རྒྱ་མཚོ་ཁོང་དུ་ཆུད་པར་བྱ་བའི་ཕྱིར་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་སེམས་བྱང་ཆུབ་ཏུ་སྐྱེ་བ་མ་ཡིན་པ་ནས་སངས་རྒྱས་ཀྱི་ཞིང་བརྗོད་དུ་མེད་པའི་ཡང་བརྗོད་དུ་མེད་པའི་རྡུལ་ཤིན་ཏུ་ཕྲ་བ་སྙེད་ཀྱི་སེམས་ཅན་གྱི་དབང་པོ་རྒྱ་མཚོ་ཁོང་དུ་ཆུད་པར་བྱ་བའི་ཕྱིར་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་སེམས་བྱང་ཆུབ་ཏུ་སྐྱེ་བ་མ་ཡིན།
en: “The bodhisattvas do not develop the aspiration for enlightenment in order to know the ocean of faculties of one being and so on up to the bodhisattvas do not develop the aspiration for enlightenment in order to know the ocean of faculties of beings as numerous as the atoms in an anabhilāpyānabhilāpya­parivarta of world realms.

source: འཇིག་རྟེན་གྱི་ཁམས་གཅིག་གི་བསྐལ་པ་གཅིག་ནས་གཅིག་ཏུ་བརྒྱུད་པར་བྱ་བ་ལ་འཇུག་པར་བྱ་བའི་ཕྱིར། བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་སེམས་བྱང་ཆུབ་ཏུ་སྐྱེ་བ་མ་ཡིན་པ་ནས། སངས་རྒྱས་ཀྱི་ཞིང་བརྗོད་དུ་མེད་པའི་ཡང་བརྗོད་དུ་མེད་པའི་རྡུལ་ཤིན་ཏུ་ཕྲ་བ་སྙེད་ཀྱི་འཇིག་རྟེན་གྱི་ཁམས་ཀྱི་བསྐལ་པ་གཅིག་ནས་གཅིག་ཏུ་བརྒྱུད་པར་བྱ་བ་ལ་འཇུག་པར་བྱ་བའི་ཕྱིར། བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་སེམས་བྱང་ཆུབ་ཏུ་སྐྱེ་བ་མ་ཡིན།
en: “The bodhisattvas do not develop the aspiration for enlightenment in order to enter the succession of kalpas in one world realm and so on up to the bodhisattvas do not develop the aspiration for enlightenment in order to enter the succession of kalpas in world realms as numerous as the atoms in an anabhilāpyānabhilāpya­parivarta of world realms.

source: འཇིག་རྟེན་གྱི་ཁམས་གཅིག་ཏུ་གཏོགས་པའི་སེམས་ཅན་ཐམས་ཅད་ཀྱི་སྤྱོད་པའི་བག་ཆགས་ཀྱི་མཚམས་སྦྱོར་བ་ལ་འཇུག་པར་བྱ་བའི་ཕྱིར། བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་སེམས་བྱང་ཆུབ་ཏུ་སྐྱེ་བ་མ་ཡིན་པ་ནས། སངས་རྒྱས་ཀྱི་ཞིང་བརྗོད་དུ་མེད་པའི་ཡང་བརྗོད་དུ་མེད་པའི་རྡུལ་ཤིན་ཏུ་ཕྲ་བ་སྙེད་ཀྱི་འཇིག་རྟེན་གྱི་ཁམས་སུ་གཏོགས་པའི་སེམས་ཅན་ཐམས་ཅད་ཀྱི་སྤྱོད་པའི་བག་ཆགས་ཀྱི་མཚམས་སྦྱོར་བ་ལ་འཇུག་པར་བྱ་བའི་ཕྱིར།
en: “The bodhisattvas do not develop the aspiration for enlightenment in order to enter an investigation of the propensities for conduct of beings in one world realm and so on up to the bodhisattvas do not develop the aspiration for enlightenment in order to enter an investigation of the propensities for conduct of beings in world realms as numerous as the atoms in an anabhilāpyānabhilāpya­parivarta of world realms.

source: བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་སེམས་བྱང་ཆུབ་ཏུ་སྐྱེ་བ་མ་ཡིན། འཇིག་རྟེན་གྱི་ཁམས་གཅིག་ཏུ་གཏོགས་པའི་སེམས་ཅན་ཐམས་ཅད་ཀྱི་ཉོན་མོངས་པ་རྒྱ་མཚོ་ཐམས་ཅད་ལ་འཇུག་པར་བྱ་བའི་ཕྱིར། བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་སེམས་བྱང་ཆུབ་ཏུ་སྐྱེ་བ་མ་ཡིན་པ་ནས། སངས་རྒྱས་ཀྱི་ཞིང་བརྗོད་དུ་མེད་པའི་ཡང་བརྗོད་དུ་མེད་པའི་རྡུལ་ཤིན་ཏུ་ཕྲ་བ་སྙེད་ཀྱི་འཇིག་རྟེན་གྱི་ཁམས་སུ་གཏོགས་པའི་སེམས་ཅན་ཐམས་ཅད་ཀྱི་ཉོན་མོངས་པ་རྒྱ་མཚོ་ཐམས་ཅད་ལ་འཇུག་པར་བྱ་བའི་ཕྱིར། བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་སེམས་བྱང་ཆུབ་ཏུ་སྐྱེ་བ་མ་ཡིན།
en: “The bodhisattvas do not develop the aspiration for enlightenment in order to comprehend the entire ocean of kleśas of all beings within one world realm and so on up to the bodhisattvas do not develop the aspiration for enlightenment in order to comprehend the entire ocean of kleśas of all beings within world realms as numerous as the atoms in an anabhilāpyānabhilāpya­parivarta of world realms.

source: འཇིག་རྟེན་གྱི་ཁམས་གཅིག་ཏུ་གཏོགས་པའི་སེམས་ཅན་ཐམས་ཅད་ཀྱི་ལས་རྒྱ་མཚོ་ཐམས་ཅད་ལ་འཇུག་པར་བྱ་བའི་ཕྱིར། བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་སེམས་བྱང་ཆུབ་ཏུ་སྐྱེ་བ་མ་ཡིན་པ་ནས། སངས་རྒྱས་ཀྱི་ཞིང་བརྗོད་དུ་མེད་པའི་ཡང་བརྗོད་དུ་མེད་པའི་རྡུལ་ཤིན་ཏུ་ཕྲ་བ་སྙེད་ཀྱི་འཇིག་རྟེན་གྱི་ཁམས་སུ་གཏོགས་པའི་སེམས་ཅན་ཐམས་ཅད་ཀྱི་ལས་རྒྱ་མཚོ་ཐམས་ཅད་ལ་འཇུག་པར་བྱ་བའི་ཕྱིར། བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་སེམས་བྱང་ཆུབ་ཏུ་སྐྱེ་བ་མ་ཡིན།
en: “The bodhisattvas do not develop the aspiration for enlightenment in order to comprehend the entire ocean of the karma of all beings within one world realm and so on up to the bodhisattvas do not develop the aspiration for enlightenment in order to comprehend the entire ocean of the karma of all beings within world realms as numerous as the atoms in an anabhilāpyānabhilāpya­parivarta of world realms.

source: འཇིག་རྟེན་གྱི་ཁམས་གཅིག་ཏུ་གཏོགས་པའི་སེམས་ཅན་ཐམས་ཅད་ཀྱི་སྤྱོད་པ་རྒྱ་མཚོ་ཐམས་ཅད་ཁོང་དུ་ཆུད་པར་བྱ་བའི་ཕྱིར། བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་སེམས་བྱང་ཆུབ་ཏུ་སྐྱེ་བ་མ་ཡིན་པ་ནས། སངས་རྒྱས་ཀྱི་ཞིང་བརྗོད་དུ་མེད་པའི་ཡང་བརྗོད་དུ་མེད་པའི་རྡུལ་ཤིན་ཏུ་ཕྲ་བ་སྙེད་ཀྱི་འཇིག་རྟེན་གྱི་ཁམས་སུ་གཏོགས་པའི་སེམས་ཅན་ཐམས་ཅད་ཀྱི་སྤྱོད་པ་རྒྱ་མཚོ་ཐམས་ཅད་ཁོང་དུ་ཆུད་པར་བྱ་བའི་ཕྱིར། བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་སེམས་བྱང་ཆུབ་ཏུ་སྐྱེ་བ་མ་ཡིན་གྱི།
en: “The bodhisattvas do not develop the aspiration for enlightenment in order to comprehend the entire ocean of the conduct of all beings within one world realm and so on up to the bodhisattvas do not develop the aspiration for enlightenment in order to comprehend the entire ocean of the conduct of all beings within world realms as numerous as the atoms in an anabhilāpyānabhilāpya­parivarta of world realms.

source: སེམས་ཅན་གྱི་ཁམས་མ་ལུས་པ་ལྷག་མ་མེད་པ་མཐའ་དག་ཐམས་ཅད་ཡོངས་སུ་སྨིན་པར་བྱ་བ་དང་། གདུལ་བའི་ཕྱིར་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་སེམས་བྱང་ཆུབ་ཏུ་སྐྱེའོ།
en: “The bodhisattvas develop the aspiration for enlightenment in order to guide and ripen the beings throughout the entirety of all world realms without exception or remainder.

source: །སངས་རྒྱས་མ་ལུས་པ་ཐམས་ཅད་བསྙེན་བཀུར་ཞིང་མཉེས་པར་བྱ་བ་དང་། མཆོད་ཅིང་རིམ་གྲོར་བྱ་བའི་ཕྱིར་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་སེམས་བྱང་ཆུབ་ཏུ་སྐྱེའོ།
en: “The bodhisattvas develop the aspiration for enlightenment in order to serve, propitiate, make offerings to, and honor all buddhas without remainder.

source: །འཇིག་རྟེན་གྱི་ཁམས་མ་ལུས་པ་ཐམས་ཅད་དུ་གཏོགས་པའི་སངས་རྒྱས་ཀྱི་རྒྱུད་བསྙེན་བཀུར་ཞིང་མཉེས་པར་བྱ་བ་དང་། མཆོད་ཅིང་རིམ་གྲོར་བྱ་བའི་ཕྱིར་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་སྨོན་ལམ་ལ་མངོན་པར་མོས་པ་ཡིན།
en: “The bodhisattvas make the prayer to serve, propitiate, make offerings to, and honor the succession of buddhas within all world realms without remainder.

source: སངས་རྒྱས་ཀྱི་ཞིང་མ་ལུས་པ་ཐམས་ཅད་ཡོངས་སུ་དག་པར་བྱ་བའི་ཕྱིར། བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་བསམ་པ་བརྟན་པར་འགྱུར་བ་ཡིན།
en: “The bodhisattvas have the firm intention to purify all buddha realms without remainder.

source: སངས་རྒྱས་ཀྱི་བསྟན་པ་མ་ལུས་པ་ཐམས་ཅད་ཡོངས་སུ་གཟུང་བའི་ཕྱིར་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་སྦྱོར་བ་འབྱུང་བ་ཡིན།
en: “The bodhisattvas are dedicated to holding the teachings of all tathāgatas without remainder.

source: དེ་བཞིན་གཤེགས་པ་རབ་ཏུ་ཞུགས་པའི་སྨོན་ལམ་རྣམ་པ་ཐ་དད་པ་མ་ལུས་པ་ཐམས་ཅད་ཀྱི་རྗེས་སུ་འབྲང་བར་བྱ་བའི་ཕྱིར་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་སེམས་ཀྱི་ཤུགས་དྲག་པོ་སྐྱེ་བ་ཡིན།
en: “The bodhisattvas have the strength of mind to comprehend the different prayers established by all buddhas without remainder.

source: དེ་བཞིན་གཤེགས་པའི་སངས་རྒྱས་ཀྱི་ཞིང་གི་ཡོན་ཏན་གྱི་རྒྱན་མ་ལུས་པ་ཐམས་ཅད་ལ་འཇུག་པར་བྱ་བའི་ཕྱིར། བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་ཡི་དམ་བརྟན་པ་སྐྱེ་བ་ཡིན།
en: “The bodhisattvas are resolved to enter the displays of the qualities of all buddha realms without remainder.

source: དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱི་འཁོར་གྱི་དཀྱིལ་འཁོར་རྒྱ་མཚོ་མ་ལུས་པ་ཐམས་ཅད་ལ་འཇུག་པར་བྱ་བའི་ཕྱིར་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་མངོན་པར་མོས་པ་འབྱུང་བ་ཡིན།
en: “The bodhisattvas develop aspiration in order to enter the circle of followers of all buddhas without remainder.

source: འགྲོ་བའི་སེམས་རྒྱ་མཚོ་མ་ལུས་པ་ཐམས་ཅད་ལ་འཇུག་པར་བྱ་བའི་ཕྱིར་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་སྨོན་ལམ་ཡོངས་སུ་སྐྱེ་བ་ཡིན།
en: “The bodhisattvas pray to comprehend the oceans of the minds of all beings without remainder.

source: སེམས་ཅན་གྱི་དབང་པོའི་འཁོར་ལོ་མ་ལུས་པ་ཐམས་ཅད་ཡོངས་སུ་ཤེས་པར་བྱ་བའི་ཕྱིར། བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་མངོན་པར་འདོད་པ་སྐྱེ་བ་ཡིན།
en: “The bodhisattvas long to comprehend the wheels of faculties of all beings without remainder.

source: སེམས་ཅན་གྱི་དབང་པོ་རྒྱ་མཚོ་མ་ལུས་པ་ཐམས་ཅད་ཁོང་དུ་ཆུད་པར་བྱ་བའི་ཕྱིར། བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་སྤྲོ་བ་སྐྱེ་བ་ཡིན།
en: “The bodhisattvas are enthused to comprehend the oceans of faculties of all beings without remainder.

source: འཇིག་རྟེན་གྱི་ཁམས་མ་ལུས་པ་ཐམས་ཅད་ཀྱི་བསྐལ་པ་གཅིག་ནས་གཅིག་ཏུ་བརྒྱུད་པ་ལ་འཇུག་པར་བྱ་བའི་ཕྱིར། བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་མོས་པ་སྐྱེ་བ་ཡིན།
en: “The bodhisattvas aspire to comprehend the succession of kalpas in all world realms without remainder.

source: སེམས་ཅན་མ་ལུས་པ་ཐམས་ཅད་ཀྱི་ཉོན་མོངས་པའི་བག་ཆགས་ཀྱི་མཚམས་སྦྱོར་བ་ཡོངས་སུ་གཅད་པའི་ཕྱིར། བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་བརྩོན་འགྲུས་ཡོངས་སུ་སྐྱེ་བ་ཡིན།
en: “The bodhisattvas have the determination to eradicate the ocean of kleśas of all beings without remainder.

source: སེམས་ཅན་མ་ལུས་པ་ཐམས་ཅད་ཀྱི་ལས་དང་ཉོན་མོངས་པའི་རྒྱ་མཚོ་བསྐམ་པའི་ཕྱིར། བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་ཡེ་ཤེས་ཆེན་པོའི་ཉི་མ་འཆར་བ་ཡིན།
en: “The bodhisattvas have the rising of the sun of great knowledge in order to dry up the ocean of the karma and kleśas of all beings without remainder.

source: སེམས་ཅན་མ་ལུས་པ་ཐམས་ཅད་ཀྱི་སྤྱོད་པ་ཡོངས་སུ་ཤེས་པར་བྱ་བའི་ཕྱིར་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་ཤེས་རབ་ཀྱི་སྣང་བ་འབྱུང་བ་ཡིན།
en: “The bodhisattvas develop the radiance of wisdom in order to know the conduct of all beings without remainder.

source: སེམས་ཅན་མ་ལུས་པ་ཐམས་ཅད་ཀྱི་སྡུག་བསྔལ་གྱི་མེའི་ཕུང་པོ་རབ་ཏུ་ཞི་བར་བྱ་བའི་ཕྱིར། བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་སྙིང་རྗེའི་སྤྲིན་ཆེན་པོ་ཀུན་ནས་འདུ་བ་ཡིན།
en: “The bodhisattvas gather the clouds of great compassion in order to end the mass of suffering of all beings without remainder.

source: རིགས་ཀྱི་བུ་མདོར་ན་དེ་དག་ལ་སྩོགས་པ་བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པའི་ཚུལ་དང་། སྒོ་གྲངས་མེད་པ་བརྒྱ་སྟོང་ཕྲག་བཅུ་དག་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱིས་ཡོངས་སུ་བསྒྲུབ་པར་བྱའོ།
en: “Noble one, in brief, the bodhisattvas accomplish these and millions of countless other ways and gateways of bodhisattva conduct.

source: །རིགས་ཀྱི་བུ་གཞན་ཡང་འདི་ལྟ་སྟེ། བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་སྤྱོད་པ་ནི་ཡེ་ཤེས་ཁོང་དུ་ཆུད་པར་བྱ་བའི་ཕྱིར། ཆོས་ཐམས་ཅད་ལ་ཡང་དག་པར་གཞོལ་བའོ།
en: “Moreover, noble one, bodhisattva conduct is the acquisition of all Dharmas in order to realize wisdom.

source: །བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་སྤྱོད་པ་ནི་ཡོངས་སུ་དག་པར་བྱ་བའི་ཕྱིར་ཞིང་ཐམས་ཅད་ལ་ཡང་དག་པར་གཞོལ་བའོ། །རིགས་ཀྱི་བུ་དེ་ལྟ་བས་ན།
en: Bodhisattva conduct is the acquisition of all realms in order to accomplish their purification.

source: ཁོ་མོས་ནི་བདག་གི་སྨོན་ལམ་ནམ་མཁའི་དབྱིངས་རྣམ་པར་དག་པའི་མཐའ་གང་དུ་ཐུག་པ་དེའི་མཐས་ཀླས་པར་ཤོག་ཤིག །བདག་གི་སྨོན་ལམ་འཇིག་རྟེན་གྱི་ཁམས་རྣམ་པར་དག་པའི་མཐའ་གང་དུ་ཐུག་པ་དེའི་མཐས་ཀླས་པར་ཤོག་ཤིག །བདག་གི་སྨོན་ལམ་སེམས་ཅན་ཐམས་ཅད་ཀྱི་ཉོན་མོངས་པ་དང་། བག་ཆགས་ཀྱི་མཚམས་སྦྱོར་བ་དང་། བག་ལ་ཉལ་བའི་མཐའ་གང་དུ་ཐུག་པ་དེའི་མཐས་ཀླས་པར་ཤོག་ཤིག །ཅེས་དེ་ལྟར་སྨོན་ལམ་བཏབ་བོ།
en: “Therefore, noble one, may my prayers reach their conclusion only when the realm of desire has been completely purified. May my prayers reach their conclusion only when the world realms are purified. May my prayers reach their conclusion only when their connection with the predispositions and propensities for the kleśas of all beings have come to an end.”

source: །སྨྲས་པ། འཕགས་མ་རྣམ་པར་ཐར་པ་འདིའི་མིང་ཅི་ཞེས་བགྱི།
en: Sudhana asked, “Āryā, what is the name of this liberation?”

source: སྨྲས་པ། རིགས་ཀྱི་བུ་རྣམ་པར་ཐར་པ་འདི་ནི་ཉོན་མོངས་པ་མེད་པ་བདེ་བའི་རྒྱལ་མཚན་ཞེས་བྱ་བ་སྟེ།
en: Āśā replied, “Noble one, this liberation is called the banner of bliss without sorrow

source: རིགས་ཀྱི་བུ་ཁོ་མོས་ཀྱང་བྱང་ཆུབ་སེམས་དཔའི་རྣམ་པར་ཐར་པ་དེ་གཅིག་པུ་ཤེས་པར་ཟད་ན་བྱང་ཆུབ་སེམས་དཔའ་སངས་རྒྱས་ཀྱི་ཆོས་ཐམས་ཅད་ཡང་དག་པར་འཛིན་པའི་ཕྱིར། སེམས་རྒྱ་མཚོ་དང་ལྡན་པ་ལྷག་པའི་བསམ་པ་བརྟན་པའི་ཕྱིར་རི་རབ་དང་འདྲ་བ། སེམས་ཅན་ཐམས་ཅད་ཀྱི་ཉོན་མོངས་པའི་ནད་རབ་ཏུ་སོས་པར་བྱེད་པའི་ཕྱིར་སྨན་གྱི་རྒྱལ་པོ་མཐོང་ན་ལེགས་པ་ལྟ་བུ། སེམས་ཅན་ཐམས་ཅད་ཀྱི་མ་རིག་པའི་མུན་པ་སེལ་བའི་ཕྱིར་ཉི་མར་གྱུར་པ། སེམས་ཅན་ཐམས་ཅད་ཀྱི་བསམ་པའི་གནས་སུ་གྱུར་པས་ས་ལྟ་བུའི་སེམས་དང་ལྡན་པ།
en: “Noble one, I know only this bodhisattva liberation.

source: འགྲོ་བ་ཐམས་ཅད་ཀྱི་དོན་བྱེད་པའི་ཕྱིར་རླུང་དུ་གྱུར་པ། སེམས་ཅན་ཐམས་ཅད་ལ་ཡེ་ཤེས་ཀྱི་སྣང་བ་འབྱིན་པའི་ཕྱིར་མར་མེར་གྱུར་པ། ཞི་བའི་སྒྲས་སངས་རྒྱས་ཀྱི་ཆོས་ཀྱི་ཆར་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་དུ་འབེབས་པའི་ཕྱིར་སྤྲིན་དུ་གྱུར་པ་བསོད་ནམས་ཀྱི་འོད་གཟེར་གྱི་དྲ་བ་རབ་ཏུ་འགྱེད་པའི་ཕྱིར་ཟླ་བ་ལྟ་བུ། འགྲོ་བ་ཐམས་ཅད་ཡོངས་སུ་བསྲུང་བ་ལ་ཞུགས་པའི་ཕྱིར། བརྒྱ་བྱིན་ལྟ་བུ་དེ་དག་གི་སྤྱོད་པ་ཤེས་པའམ། ཡོན་ཏན་བརྗོད་པའམ།
en: How could I know or describe the qualities of the conduct of bodhisattvas who have minds like an ocean because they have received all the Buddhadharma, who are like Mount Meru because of their firm commitment, who are like beautiful kings of healing because they free all beings from the illness of the kleśas, who are like the sun because they dispel the darkness of ignorance for all beings, who have minds that are like the earth because they support the aspirations of all beings, who are like the air because they benefit all beings, who are like lamps because they bring the light of knowledge to all beings, who are like clouds because they send down with peaceful sounds a rain of the Buddhadharma, who are like the moon because they emit a network of light rays of merit, and who are like Śakra because they are dedicated to the protection of all beings?

source: བྱང་ཆུབ་སེམས་དཔའི་བསླབ་པ་བསམ་གྱིས་མི་ཁྱབ་པ་སྨོས་པའམ།
en: How could I speak of their inconceivable bodhisattva training?

source: བྱང་ཆུབ་སེམས་དཔའི་སྨོན་ལམ་གྱི་རྣམ་པ་མཐའ་དང་དབུས་མེད་པ་ཡོངས་སུ་བསྟན་པར་ནུས་རེ་སྐན།
en: How could I teach the forms of their bodhisattva prayers? “Depart, noble one.

source: །སོང་རིགས་ཀྱི་བུ་ལྷོ་ཕྱོགས་ཀྱི་རྒྱུད་འདི་ཉིད་ཀྱི་རྒྱ་མཚོ་རྣམ་པར་རློབ་པ་འདི་ན་ཡུལ་ཆུ་བ་གཙང་མ་ཞེས་བྱ་བ་ཡོད་དེ།
en: In this southern region, in this Samudravetāḍī, there is a land called Nālayu. There dwells a ṛṣi by the name of Bhīṣmottara­nirghoṣa.

source: དེ་ན་དྲང་སྲོང་འཇིགས་མཆོག་དབྱངས་ཤེས་བྱ་བ་འདུག་གི་དེའི་གན་དུ་སོང་ལ་དྲིས་ཤིག་དང་། དེས་རིགས་ཀྱི་བུ་ཁྱོད་ལ་བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་སྟོན་པར་འགྱུར་རོ།
en: “Go to him and ask him. Noble one, he will teach you the bodhisattva conduct.”

source: །དེ་ནས་ཚོང་དཔོན་གྱི་བུ་ནོར་བཟངས་ཀྱིས་དགེ་བསྙེན་མ་ཡིད་བཞིན་གྱི་རྐང་པ་གཉིས་ལ་སྤྱི་བོས་ཕྱག་འཚལ་ཏེ། དགེ་བསྙེན་མ་ཡིད་བཞིན་ལ་ལན་བརྒྱ་སྟོང་དུ་མར་གཡས་ཕྱོགས་སུ་བསྐོར་བ་བྱས་ནས།
en: Then Sudhana, the head merchant’s son, bowed his head to the feet of the upāsikā Āśā and circumambulated the upāsikā Āśā, keeping her to his right, a hundred thousand times.

source: ཡང་དང་ཡང་བལྟས་ཏེ་ཕྱག་འཚལ་ནས། ངོ་མཆི་མས་གང་བར་ངུས་ཏེ། བྱང་ཆུབ་མཆོག་ཏུ་དཀོན་པ་རྗེས་སུ་སེམས་ཤིང་དགེ་བའི་བཤེས་གཉེན་རིམ་གྲོར་བྱ་བ་དཀོན་པ་རྗེས་སུ་བསམ་པ་དང་། སྐྱེས་བུ་དམ་པ་དང་འཕྲད་པ་དཀོན་པ་རྗེས་སུ་བསམ་པ་དང་། བྱང་ཆུབ་སེམས་དཔའི་དབང་པོ་འཐོབ་པར་བྱ་བ་རྗེས་སུ་བསམ་པ་དང་། བྱང་ཆུབ་སེམས་དཔའི་བསམ་པ་ཡོངས་སུ་དག་པ་དཀོན་པ་རྗེས་སུ་བསམ་པ་དང་། སྐལ་བ་མཉམ་པའི་དགེ་བའི་བཤེས་གཉེན་དང་ཕྲད་པ་དཀོན་པ་རྗེས་སུ་བསམ་པ་དང་། བྱང་ཆུབ་ཏུ་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་དུ་མངོན་པར་མོས་ཤིང་སེམས་ངེས་པར་གཞོག་པ་དཀོན་པ་རྗེས་སུ་བསམ་པ་དང་། མི་མཉམ་པ་མེད་པའི་ཆོས་ཀྱི་ཚུལ་རྗེས་སུ་བསྟན་པའི་སྦྱོར་བ་དཀོན་པ་རྗེས་སུ་བསམ་པ་དང་། སེམས་དྲི་མ་མེད་ཅིང་མི་འཕྲོགས་པའི་སྦྱོར་བ་ཡང་དག་པར་བསྒྲུབ་པར་དཀའ་བ་རྗེས་སུ་བསམ་པ་དང་། ཐམས་ཅད་མཁྱེན་པ་ཉིད་དུ་ཤུགས་དྲག་པོ་རྣམ་པར་བསྐྱེད་པའི་ཆོས་ཀྱི་སྣང་བ་དཀོན་པ་རྗེས་སུ་བསམ་པ་བྱེད་ཅིང་། དགེ་བསྙེན་མ་ཡིད་བཞིན་གྱི་དྲུང་ནས་སོང་ངོ་།
en: Looking back again and again, bowing, his face covered with tears, thinking of the rarity of the highest enlightenment, thinking of the rarity of being able to honor a kalyāṇamitra, thinking of the rarity of meeting a superior being, thinking of the rarity of attaining the faculties of a bodhisattva, thinking of the rarity of attaining the pure motivation of a bodhisattva, thinking of the rarity of meeting suitable companions, thinking of the rarity of having in mind the true aspiration for enlightenment, thinking of the rarity of practicing the teaching of the unequaled Dharma, thinking of the rarity of the practice of an unwavering and stainless mind, and thinking of the rarity of the light of the Dharma that creates the power of omniscience, he departed from the presence of the upāsikā Āśā. Bhīṣmottara­nirghoṣa

source: དེ་ནས་ཚོང་དཔོན་གྱི་བུ་ནོར་བཟངས་བྱང་ཆུབ་སེམས་དཔའི་གདམས་ངག་གི་རྗེས་སུ་སོང་བའི་སེམས་དང་ལྡན་པ། བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་ཡོངས་སུ་དག་པར་བྱེད་པའི་རྗེས་སུ་སོང་བའི་སེམས་དང་ལྡན་པ་བྱང་ཆུབ་སེམས་དཔའི་བསོད་ནམས་ཀྱི་སྟོབས་རྣམ་པར་འཕེལ་བར་བྱ་བའི་སེམས་དང་ལྡན་པ། སངས་རྒྱས་བལྟ་བའི་ཤུགས་དྲག་པོས་རབ་ཏུ་སྣང་བར་བྱ་བའི་སེམས་དང་ལྡན་པ། ཆོས་ཀྱི་གཏེར་འཐོབ་པར་བྱ་བ་ལ་ཤུགས་དྲག་པོ་སྐྱེས་པའི་སེམས་དང་ལྡན་པ། སྨོན་ལམ་ཆེན་པོ་མངོན་པར་བསྒྲུབ་པའི་ཤུགས་དྲག་པོ་རབ་ཏུ་འཕེལ་བའི་སེམས་དང་ལྡན་པ་ཆོས་ཐམས་ཅད་ཀྱི་ཕྱོགས་ལ་མངོན་དུ་ལྟ་བའི་སེམས་དང་ལྡན་པ།
en: Then Sudhana, the head merchant’s son, thinking of following the bodhisattva instructions, thinking of following the pure conduct of bodhisattvas, thinking of increasing the strength of the merit of bodhisattvas, thinking of the illumination of the power of seeing the buddhas, thinking of developing the power to attain the treasure of the Dharma, thinking of increasing the power of accomplishing the great prayers, thinking of facing every direction in the realm of the Dharma, thinking of the illumination of the nature of the Dharma, thinking of the dispersal of all obscurations, thinking of looking at the realm of Dharma free of darkness, thinking of the motivation that is stainless and unbreakable like Nārāyaṇa ’s precious vajra, and thinking of invincibility and unassailability in the face of all the māra armies, eventually arrived in the land of Nālayu.

source: ཆོས་ཀྱི་རང་བཞིན་གྱི་འོད་ཀྱིས་སྣང་བར་བྱས་པའི་སེམས་དང་ལྡན་པ། སྒྲིབ་པ་ཐམས་ཅད་རྣམ་པར་འཐོར་བའི་སེམས་དང་ལྡན་པ། ཆོས་ཀྱི་དབྱིངས་ལ་མུན་པ་མེད་པར་རྣམ་པར་ལྟ་བའི་སེམས་དང་ལྡན་པ། རྡོ་རྗེ་རིན་པོ་ཆེ་མཐུ་བོ་ཆེས་མྱི་ཆོམས་པ་ལྟར་དྲི་མ་མེད་པའི་སེམས་དང་ལྡན་པ། བདུད་ཐམས་ཅད་ཀྱི་དཔུང་གིས་བརྒལ་བར་དཀའ་ཞིང་ཐུབ་པར་དཀའ་བའི་སེམས་དང་ལྡན་པ་དེ་མཐར་གྱིས་ཡུལ་ཆུ་བ་གཙང་མ་ག་ལ་བ་དེར་ཕྱིན་ནས།
en: He searched and searched for the ṛṣi Bhīṣmottara­nirghoṣa.

source: དྲང་སྲོང་འཇིགས་མཆོག་དབྱངས་ཚོལ་ཚོལ་བ་ལས། དེའི་ཚེ་དྲང་སྲོང་འཇིགས་མཆོག་དབྱངས་དགེ་བ་སྦྱང་བའི་གནས་ཤིང་དང་། ཤིང་ཕྲན་སྣ་ཚོགས་གྲངས་མེད་པའི་ནགས་ཚལ་མདངས་དགའ་བ།
en: At that time, the ṛṣi Bhīṣmottara­nirghoṣa was dwelling in an ashram in a delightful forest of countless different kinds of trees and creepers.

source: ལོ་མས་རྒྱས་པའི་ཤིང་གིས་ཀུན་ནས་འགྲིགས་པ། རྟག་ཏུ་མེ་ཏོག་རྒྱས་པ་དང་ལྡན་པའི་ཤིང་སྣ་ཚོགས་ཅན། རྟག་ཏུ་ཤིང་ཏོག་མང་པོ་དང་ལྡན་པའི་ཤིང་ཏོག་གི་ཤིང་དང་ལྡན་པ།
en: In that forest there was a canopy of the leaves of various trees, there were always flowers blossoming on trees of various kinds, and there were fruit trees always laden with fruit.

source: ནོར་བུ་རིན་པོ་ཆེ་སྣ་ཚོགས་ཀྱི་ཤིང་དྲུང་ནོར་བུ་རིན་པོ་ཆེའི་སྤང་ལེབ་ཀྱིས་རྟག་ཏུ་གཤིབས་པ་དང་ལྡན་པ།
en: Platforms of precious fruit had formed at the feet of trees that were made of the various kinds of precious materials.

source: ཙན་དན་དམ་པའི་ཤིང་ཀུན་ནས་རྣམ་པར་བྲེས་པ།
en: There were beautifully proportioned tall sandalwood trees.

source: ཨ་གུ་རུ་ཡིད་དུ་འོང་བའི་ཤིང་ལས་སྤོས་ཀྱི་དྲི་རྟག་ཏུ་འབྱུང་བས་རབ་ཏུ་བརྒྱན་པ།
en: The forest was made pleasant by the aroma that constantly came from beautiful agarwood trees.

source: ཕྱོགས་བཞི་ནས་ཤིང་བ་ཏ་ལ་རྣམ་པར་མཛེས་པར་སྐྱེས་པས་ཡོངས་སུ་བརྒྱན་པ། ནྱ་གྲོ་དའི་ཤིང་དབྱིབས་ཡིད་དུ་འོང་བ་དང་ལྡན་པ།
en: It was beautified by scents in all four directions. It was adorned by perfectly proportioned bignonia trees. There were beautifully formed banyan trees.

source: འཛམ་བུའི་ཤིང་ལས་རྟག་ཏུ་ཤིང་ཏོག་སྨིན་པ་འབྲུལ་བ།
en: Ripened fruits were constantly falling from jambul trees.

source: མེ་ཏོག་གི་ཚལ་པདྨོ་དང་ཨུཏ་པ་ལ་གསར་དུ་སྐྱེས་པས་རབ་ཏུ་བརྒྱན་པ་ཞིག་ན་འདུག་འདུག་སྟེ།
en: It was beautified by fresh red lotuses, blue lotuses, and night lotuses.

source: ཚོང་དཔོན་གྱི་བུ་ནོར་བཟངས་ཀྱིས་དྲང་སྲོང་འཇིགས་མཆོག་དབྱངས་དྲང་སྲོང་སྟོང་ཕྲག་བཅུས་བསྐོར་ཅིང་།
en: Sudhana saw the ṛṣi Bhīṣmottara­nirghoṣa and circumambulated the ṛṣi Bhīṣmottara­nirghoṣa a hundred thousand times, keeping him to his right.
